### Setup

In [181]:
import datetime as dt
import numpy as np
import pandas as pd


import sqlalchemy
from sqlalchemy.ext.automap import automap_base
from sqlalchemy.orm import Session
from sqlalchemy.ext.declarative import declarative_base
from sqlalchemy import create_engine, func, inspect
import psycopg2

from flask import Flask, jsonify

In [182]:
engine = create_engine('postgresql+psycopg2://postgres:postgres@localhost:5432/coffee_dataset_db')

In [183]:
# Create an engine that can talk to the database
conn = engine.connect()

In [ ]:
# Base.metadata.create_all(engine)

In [ ]:
# session = Session(bind=engine)

In [ ]:
# # Reflect Database into ORM class
# Base = automap_base()
# # reflect the tables
# Base.prepare(engine, reflect=True)
# Base.classes.keys()

In [ ]:
# Coffee = Base.classes.coffee

In [184]:
inspector = inspect(engine)
inspector.get_table_names()

['imports', 'exports', 'prices_paid_to_growers', 'retail_prices']

### Explore Coffee Database

In [188]:
imports = pd.read_sql("SELECT * FROM imports", conn)
imports.head()

   Id             Country  Year  Import_Volume
0   0             Austria  1990    1879.717004
1   1             Belgium  1990       0.000000
2   2  Belgium_Luxembourg  1990    2014.954017
3   3            Bulgaria  1990     268.182998
4   4             Croatia  1990       0.000000

In [189]:
exports = pd.read_sql("SELECT * FROM exports", conn)
exports.head()

   Id                           Country  Year  Export_Volume
0   0                            Angola  1990        84.3500
1   1  Bolivia (Plurinational State of)  1990       156.4420
2   2                            Brazil  1990     16935.7876
3   3                           Burundi  1990       584.7730
4   4                          Cameroon  1990      2611.2590

In [190]:
prices_paid_to_growers = pd.read_sql("SELECT * FROM prices_paid_to_growers", conn)
prices_paid_to_growers.head()

   Id             Country  Year  Growers_Price
0   0             Austria  1990     1879.71700
1   1             Belgium  1990        0.00000
2   2  Belgium_Luxembourg  1990     2014.95400
3   3            Bulgaria  1990      268.18298
4   4             Croatia  1990        0.00000

In [191]:
retail_prices = pd.read_sql("SELECT * FROM retail_prices", conn)
retail_prices.head()

   Id   Country  Year  Retail_Price
0   0   Austria  1990          4.90
1   1   Belgium  1990          3.27
2   2  Bulgaria  1990          0.00
3   3    Cyprus  1990          2.83
4   4   Czechia  1990          0.00

In [ ]:
# Get a list of column names and types
columns = inspector.get_columns('coffee_data')
for c in columns:
    print(c['name'], c["type"])
# columns

In [ ]:
# Query all records in the Database
data = engine.execute("SELECT * FROM coffee_data")

for record in data:
    print(record)

In [ ]:
# # Design a query to retrieve the last 12 months of precipitation data and plot the results. 

# # Perform a query to retrieve the data 

# query_country = "Austria"


# results = session.query(data.Country, 
#                         data.Year, data.Import_Volume).all()


# # Save the query results as a Pandas DataFrame and set the index to the Country

# Austria_df = pd.DataFrame({"Country": result[0], "Year": result[1], "Import_Volume": result[2]} for result in results)
# Austria_df.set_index(["Country"])

### Reflect and Query

In [ ]:
# Reflect Database into ORM class
Base = automap_base()
# reflect the tables
Base.prepare(autoload_with=engine)
Base.classes.keys()

In [ ]:
Coffee = Base.classes.coffee

In [ ]:
# create a session
session = Session(engine)